In [6]:
import pandas as pd
df1 = pd.DataFrame({ 'id' : [1, 2, 3], 
                    'customer_id' : [1, 2, 3], 
                    'customer_name' : ['Robert', 'Peter', 'Dave']})
df1

   id  customer_id customer_name
0   1            1        Robert
1   2            2         Peter
2   3            3          Dave

In [7]:
df2 = pd.DataFrame({'id' : [1, 2, 4],
                    'order_id' : [100, 200, 300],
                    'order_date' : ['2021-01-21', '2021-02-03', '2020-10-01']})
df2

   id  order_id  order_date
0   1       100  2021-01-21
1   2       200  2021-02-03
2   4       300  2020-10-01

### [ 1. 두 Dataframe 연결하기 ]

##### concat() : 두 데이터 프레임을 연결해서   하나의 데이터 프레임으로 만들 수 있다.
- 두 데이터프레임을 (위/아래) 혹은 (왼쪽/오른쪽) 으로 연결하기만 한다.
- axis : 0 (디폴트) 이면 위에서 아래로 합치고, 1이면 왼쪽과 오른쪽으로 합친다.
- pd.concat( [ 데이터프레임1,데이터프레임2 ], axis )

In [9]:
# (위/아래) 연결
pd.concat([df1,df2])

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert       NaN         NaN
1   2          2.0         Peter       NaN         NaN
2   3          3.0          Dave       NaN         NaN
0   1          NaN           NaN     100.0  2021-01-21
1   2          NaN           NaN     200.0  2021-02-03
2   4          NaN           NaN     300.0  2020-10-01

In [10]:
# (왼쪽/오른쪽) 연결
pd.concat([df1,df2], axis=1)

   id  customer_id customer_name  id  order_id  order_date
0   1            1        Robert   1       100  2021-01-21
1   2            2         Peter   2       200  2021-02-03
2   3            3          Dave   4       300  2020-10-01

### [ 2. 두 Dataframe 병합하기 ]

##### merge() : 두 데이터  프레임을 합치기
- 두 데이터프레임에 동일한 이름을 가진 column을 기준으로 데이터프레임을 합친다.
- (1) pd.merge(데이터프레임1, 데이터프레임2)
- (2) pd.merge(데이터프레임1, 데이터프레임2, on = 기준컬럼명) : 기준 컬럼을 명시할 수도 있음
- (3) pd.merge(데이터프레임1, 데이터프레임2, how = 결합방법)
   - inner : 내부 조인 (default값과 동일), SQL의 INNER JOIN 과 동일
   - outer : 완전 외부 조인              , SQL의 OUTER JOIN 과 동일
   - left  : 왼쪽 우선 외부 조인         , SQL의 LEFT OUTER JOIN 과 동일
   - right : 오른쪽 우선 외부 조인       , SQL의 RIGHT OUTER JOIN 과 동일

#### (1) 기본병합

In [11]:
# 동일 컬럼인 id기준으로 데이터 프레임을 합쳤다.
pd.merge(df1,df2)

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

In [13]:
# 기준이 될 id컬럼을 명시
# 이때, inner방식이 디폴트로 설정되어있음
pd.merge(df1, df2, on = 'id')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

#### (2) inner : 내부 조인
- on의 컬럼값이 두 데이터 프레임에서 동일한 행 찾기 
- 각 동일한 행의 컬럼/컬럼 값만 가져오기

 <img src="https://www.fun-coding.org/00_Images/merge_inner.jpg" />

In [15]:
# inner를 명시적으로 써주기위해 , how옵션을 사용할 수 있다.
pd.merge(df1, df2, on = 'id', how = 'inner')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert       100  2021-01-21
1   2            2         Peter       200  2021-02-03

#### (3) Outer : 외부 조인

 ##### < 완전 외부 조인 >
  - on의 컬럼값이 두 데이터프레임에서 동일한 행 찾기
  - 각 동일한 행의 컬럼/컬럼값 가져와 붙이기
  - 각 데이터프레임에서 on의 컬럼값이 다른 나머지 행을 찾기
  - 각 나머지 행의 컬럼/컬럼값을 가져와 별도 행으로 붙이기
     - 두 데이터프레임 각각에만 있는 컬럼이어서, 컬럼값이 없을 경우 데이터 없음(NaN)으로 표기하기
     
  <img src="https://www.fun-coding.org/00_Images/merge_outer.jpg" />

In [16]:
pd.merge(df1, df2, how = 'outer')

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert     100.0  2021-01-21
1   2          2.0         Peter     200.0  2021-02-03
2   3          3.0          Dave       NaN         NaN
3   4          NaN           NaN     300.0  2020-10-01

##### < 왼쪽 우선 외부 조인 >

  - 왼쪽 데이터프레임의 행을 모두 가져오기
  - 왼쪽 데이터프레임의 행에 있는 on의 컬럼값이 동일한 오른쪽 데이터프레임의 행만 컬럼과 함께 가져와 붙이기
  - 오른쪽 데이터프레임에 없는 on의 컬럼값을 가진 왼쪽 데이터프레임의 오른쪽 데이터프레임 컬럼들에는 데이터 없음(NaN)으로 표기하기
     
  <img src="https://www.fun-coding.org/00_Images/merge_left_outer.jpg" />

In [17]:
pd.merge(df1, df2, how = 'left')

   id  customer_id customer_name  order_id  order_date
0   1            1        Robert     100.0  2021-01-21
1   2            2         Peter     200.0  2021-02-03
2   3            3          Dave       NaN         NaN

##### < 오른쪽 우선 외부 조인 >
- 오른쪽 데이터프레임의 행을 모두 가져오기
- 오른쪽 데이터프레임의 행에 있는 on의 컬럼값이 동일한 왼쪽 데이터프레임의 행만 컬럼과 함께 가져와 붙이기
- 왼쪽 데이터프레임에 없는 on의 컬럼값을 가진 오른쪽 데이터프레임의 왼쪽 데이터프레임 컬럼들에는 데이터 없음(NaN)으로 표기하기
     
  <img src="https://www.fun-coding.org/00_Images/merge_right_outer.jpg" />

In [18]:
pd.merge(df1, df2, how = 'right')

   id  customer_id customer_name  order_id  order_date
0   1          1.0        Robert       100  2021-01-21
1   2          2.0         Peter       200  2021-02-03
2   4          NaN           NaN       300  2020-10-01

### [ 3. Dataframe 조작하기 연습 ]

In [19]:
df1 = df1.set_index('id')
df1

    customer_id customer_name
id
1             1        Robert
2             2         Peter
3             3          Dave

In [20]:
df2 = df2.set_index('id')
df2

    order_id  order_date
id
1        100  2021-01-21
2        200  2021-02-03
4        300  2020-10-01

In [23]:
df_merge = pd.merge( df1, df2, on = 'id' )
df_merge

    customer_id customer_name  order_id  order_date
id
1             1        Robert       100  2021-01-21
2             2         Peter       200  2021-02-03

In [24]:
df_merge = pd.merge( df1, df2, on = 'id', how = 'outer' )
df_merge

    customer_id customer_name  order_id  order_date
id
1           1.0        Robert     100.0  2021-01-21
2           2.0         Peter     200.0  2021-02-03
3           3.0          Dave       NaN         NaN
4           NaN           NaN     300.0  2020-10-01